using System;
using static System.Console;

namespace Airplane_Pilot_Simulator
{
    [Serializable]
    public class Display
    {
        public static void Greeting()
        {
            WriteLine("\n\t\tПрограмма «Тренажер пилота самолета»\n");
            WriteLine("\t\t\tУправление:\n" +
                "\t• Скорость — изменяется клавишами-стрелками:\n" +
                "   Right: +50 км/ч\n" +
                "   Left: –50 км/ч\n" +
                "   Shift-Right: +150 км/ч\n" +
                "   Shift-Left: –150 км/ч\n\n" +
                "\t• Высота — изменяется клавишами-стрелками:\n" +
                "   Up: +250 м\n" +
                "   Down: –250 м\n" +
                "   Shift-Up: +500 м\n" +
                "   Shift-Down: –500 м\n\n" +
                "\t\tСЛЕДИТЕ ЗА КОМАНДАМИ ДИСПЕТЧЕРА!");
        }

        public static void PlanP() {
            SetCursorPosition(0, 5);
            Write(@"
         _______________________________________________________________________________________
        |                                            |           Управление:                    |
        |                                            | Right: +50 км/ч                          |
        |                                            | Left: -50 км/ч                           |
        |                                            | Shift-Right: +150 км/ч                   |
        |                                            | Shift-Left: -150 км/ч                    |
        |                                            | Up: +250 м                               |
        |                                            | Down: -250 м                             |
        |                                            | Shift-Up: +500 м                         |
        |                                            | Shift-Down: -500 м                       |
        |---------------------------------------------------------------------------------------|
        |                                            | За отклонение от рекомендаций диспетчера |
        |                                            | начисляются штрафные баллы:              |
        |                                            | 300-599 м - 25 баллов;                   |
        |                                            | 600-999 м - 50 баллов;                   | 
        |                                            | превышение от 1000 - гибель самолета     |
        |____________________________________________|__________________________________________|
"); 
        }
    }
}
